
public class Main {

	public static void main(String[] args) {
		/*
		 * 1월 23일 ~ 1월 29일(일) 주간 회고록
		 * 
		 * 백준 문제는 왜 이렇게 어려운 것인가.
		 * 정말 요리조리 고민해봐도 답이 안나오는 경우가 허다했다.
		 *
		 * 자존심 상하지만,
		 * 풀이를 검색하면 쫘-악 나오는데
		 * 다들 이게 쉽다며 풀이를 보여준다.
		 *  
		 * 근데 이게 또 풀이를 보면
		 * "아!" 하며 머리에 뭐가 지나간다.
		 * 계속 수동적으로 강의만 듣던 내가 스스로 도전하는게 이렇게 재미있을 줄이야..
		 * 시간 가는 줄 모르고 하다가, 또 이것만 하면 안될 것 같아서
		 * 스프링 강의를 조금씩 듣기 시작했다.
		 * 근데 참... 이건 또 왜이렇게 어려운걸까
		 * 일단 겨우 따라하며 써내려가기는 하는데,
		 * 내가 지금 무얼 하는지도 모르겠다.
		 * 
		 * 스프링의 중요도는 귀가 닳도록 들어왔기에,
		 * 절대 포기할 수 없다.
		 * "안되면 될때까지!" 정신으로 계속 들어야겠다.
		 * 
		 * 자바 강의도 3회독 시작!
		 * 
		 * 내 찬란한 미래를 위해.
		 * 힘내자 ㄴㅏ 자신...
		 * 
		 */
	}

}
